---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.PlanarMultiPlanarShapeInSketch
source: html/a4316b4b-e4cb-aad1-3c3f-f9d6234016d9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.PlanarMultiPlanarShapeInSketch Property

The current shape is only bent in a single plane. A multi-planar definition is not required. Please redefine the shape on the top plane only.

## Syntax (C#)
```csharp
public static FailureDefinitionId PlanarMultiPlanarShapeInSketch { get; }
```